# Relatório de Análise IV

## Seleções e Frequências

In [2]:
import pandas as pd

In [3]:
dados= pd.read_csv('dados/aluguel_residencial.csv', ';')
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

In [4]:
# Selecione somente os imoveis classificados com tipo 'Apartamentos'
selecao = dados['Tipo'] == 'Apartamento'
dados_apartamentos= dados[selecao]
frequencia_apartamentos= dados.shape[0]
frequencia_apartamentos

22580

In [10]:
# Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'
selecao= (dados['Tipo'] == 'Casa') | (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila')
dados_casas=dados[selecao]
frequencia_casas = dados_casas.shape[0] 
frequencia_casas

2212

In [12]:
# Selecione os imóveis com área entre 60 e 100 metros quatrados, incluindo limites
selecao = (dados['Area'] >= 60) & (dados['Area'] <= 100) 
dados_area = dados[selecao]
frequencia_area= dados_area.shape[0]
frequencia_area

8719

In [14]:
# Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$: 2.000,00
selecao = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)
dados_quartos_valor= dados[selecao]
frequencia_quartos_valor= dados_quartos_valor.shape[0]
frequencia_quartos_valor

41

In [17]:
print('Número de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$: 2.000,00 -> {}'.format(frequencia_quartos_valor))
print('Número de imóveis com área entre 60 e 100 metros quatrados, incluindo limites -> {}'.format(frequencia_area))
print("Número de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila' -> {}".format(frequencia_casas))
print("Número de imóveis classificados com tipo 'Apartamentos'-> {}".format(frequencia_apartamentos))

Número de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$: 2.000,00 -> 41
Número de imóveis com área entre 60 e 100 metros quatrados, incluindo limites -> 8719
Número de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila' -> 2212
Número de imóveis classificados com tipo 'Apartamentos'-> 22580

# Exercícios

In [23]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [20]:
alunos_aprovados = alunos[alunos['Aprovado'] == True]

In [21]:
alunos_aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [25]:
alunos_aprovados_F = alunos[(alunos['Aprovado'] == True)&(alunos['Sexo']=="F")] 
alunos_aprovados_F

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True